MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F105RB/mcu.h
#define RCC_CFGR2_PREDIV1_DIV1               0x00000000U                       /*!< PREDIV1 input clock not divided */
#define RCC_CFGR2_PREDIV1_DIV2_Pos           (0U)                              
#define RCC_CFGR2_PREDIV1_DIV2_Msk           (0x1UL << RCC_CFGR2_PREDIV1_DIV2_Pos) /*!< 0x00000001 */
#define RCC_CFGR2_PREDIV1_DIV2               RCC_CFGR2_PREDIV1_DIV2_Msk        /*!< PREDIV1 input clock divided by 2 */
#define RCC_CFGR2_PREDIV1_DIV3_Pos           (1U)                              
#define RCC_CFGR2_PREDIV1_DIV3_Msk           (0x1UL << RCC_CFGR2_PREDIV1_DIV3_Pos) /*!< 0x00000002 */
#define RCC_CFGR2_PREDIV1_DIV3               RCC_CFGR2_PREDIV1_DIV3_Msk        /*!< PREDIV1 input clock divided by 3 */
#define RCC_CFGR2_PREDIV1_DIV4_Pos           (0U)                              
#define RCC_CFGR2_PREDIV1_DIV4_Msk           (0x3UL << RCC_CFGR2_PREDIV1_DIV4_Pos) /*!< 0x00000003 */
#define RCC_CFGR2_PREDIV1_DIV4               RCC_CFGR2_PREDIV1_DIV4_Msk        /*!< PREDIV1 input clock divided by 4 */
#define RCC_CFGR2_PREDIV1_DIV5_Pos           (2U)                              
#define RCC_CFGR2_PREDIV1_DIV5_Msk           (0x1UL << RCC_CFGR2_PREDIV1_DIV5_Pos) /*!< 0x00000004 */
#define RCC_CFGR2_PREDIV1_DIV5               RCC_CFGR2_PREDIV1_DIV5_Msk        /*!< PREDIV1 input clock divided by 5 */
#define RCC_CFGR2_PREDIV1_DIV6_Pos           (0U)                              
#define RCC_CFGR2_PREDIV1_DIV6_Msk           (0x5UL << RCC_CFGR2_PREDIV1_DIV6_Pos) /*!< 0x00000005 */
#define RCC_CFGR2_PREDIV1_DIV6               RCC_CFGR2_PREDIV1_DIV6_Msk        /*!< PREDIV1 input clock divided by 6 */
#define RCC_CFGR2_PREDIV1_DIV7_Pos           (1U)                              
#define RCC_CFGR2_PREDIV1_DIV7_Msk           (0x3UL << RCC_CFGR2_PREDIV1_DIV7_Pos) /*!< 0x00000006 */
#define RCC_CFGR2_PREDIV1_DIV7               RCC_CFGR2_PREDIV1_DIV7_Msk        /*!< PREDIV1 input clock divided by 7 */
#define RCC_CFGR2_PREDIV1_DIV8_Pos           (0U)                              
#define RCC_CFGR2_PREDIV1_DIV8_Msk           (0x7UL << RCC_CFGR2_PREDIV1_DIV8_Pos) /*!< 0x00000007 */
#define RCC_CFGR2_PREDIV1_DIV8               RCC_CFGR2_PREDIV1_DIV8_Msk        /*!< PREDIV1 input clock divided by 8 */
#define RCC_CFGR2_PREDIV1_DIV9_Pos           (3U)                              
#define RCC_CFGR2_PREDIV1_DIV9_Msk           (0x1UL << RCC_CFGR2_PREDIV1_DIV9_Pos) /*!< 0x00000008 */
#define RCC_CFGR2_PREDIV1_DIV9               RCC_CFGR2_PREDIV1_DIV9_Msk        /*!< PREDIV1 input clock divided by 9 */
#define RCC_CFGR2_PREDIV1_DIV10_Pos          (0U)                              
#define RCC_CFGR2_PREDIV1_DIV10_Msk          (0x9UL << RCC_CFGR2_PREDIV1_DIV10_Pos) /*!< 0x00000009 */
#define RCC_CFGR2_PREDIV1_DIV10              RCC_CFGR2_PREDIV1_DIV10_Msk       /*!< PREDIV1 input clock divided by 10 */
#define RCC_CFGR2_PREDIV1_DIV11_Pos          (1U)                              
#define RCC_CFGR2_PREDIV1_DIV11_Msk          (0x5UL << RCC_CFGR2_PREDIV1_DIV11_Pos) /*!< 0x0000000A */
#define RCC_CFGR2_PREDIV1_DIV11              RCC_CFGR2_PREDIV1_DIV11_Msk       /*!< PREDIV1 input clock divided by 11 */
#define RCC_CFGR2_PREDIV1_DIV12_Pos          (0U)                              
#define RCC_CFGR2_PREDIV1_DIV12_Msk          (0xBUL << RCC_CFGR2_PREDIV1_DIV12_Pos) /*!< 0x0000000B */
#define RCC_CFGR2_PREDIV1_DIV12              RCC_CFGR2_PREDIV1_DIV12_Msk       /*!< PREDIV1 input clock divided by 12 */
#define RCC_CFGR2_PREDIV1_DIV13_Pos          (2U)                              
#define RCC_CFGR2_PREDIV1_DIV13_Msk          (0x3UL << RCC_CFGR2_PREDIV1_DIV13_Pos) /*!< 0x0000000C */
#define RCC_CFGR2_PREDIV1_DIV13              RCC_CFGR2_PREDIV1_DIV13_Msk       /*!< PREDIV1 input clock divided by 13 */
#define RCC_CFGR2_PREDIV1_DIV14_Pos          (0U)                              
#define RCC_CFGR2_PREDIV1_DIV14_Msk          (0xDUL << RCC_CFGR2_PREDIV1_DIV14_Pos) /*!< 0x0000000D */
#define RCC_CFGR2_PREDIV1_DIV14              RCC_CFGR2_PREDIV1_DIV14_Msk       /*!< PREDIV1 input clock divided by 14 */
#define RCC_CFGR2_PREDIV1_DIV15_Pos          (1U)                              
#define RCC_CFGR2_PREDIV1_DIV15_Msk          (0x7UL << RCC_CFGR2_PREDIV1_DIV15_Pos) /*!< 0x0000000E */
#define RCC_CFGR2_PREDIV1_DIV15              RCC_CFGR2_PREDIV1_DIV15_Msk       /*!< PREDIV1 input clock divided by 15 */
#define RCC_CFGR2_PREDIV1_DIV16_Pos          (0U)                              
#define RCC_CFGR2_PREDIV1_DIV16_Msk          (0xFUL << RCC_CFGR2_PREDIV1_DIV16_Pos) /*!< 0x0000000F */
#define RCC_CFGR2_PREDIV1_DIV16              RCC_CFGR2_PREDIV1_DIV16_Msk       /*!< PREDIV1 input clock divided by 16 */

/*!< PREDIV2 configuration */
#define RCC_CFGR2_PREDIV2_Pos                (4U)                              
#define RCC_CFGR2_PREDIV2_Msk                (0xFUL << RCC_CFGR2_PREDIV2_Pos)   /*!< 0x000000F0 */
#define RCC_CFGR2_PREDIV2                    RCC_CFGR2_PREDIV2_Msk             /*!< PREDIV2[3:0] bits */
#define RCC_CFGR2_PREDIV2_0                  (0x1UL << RCC_CFGR2_PREDIV2_Pos)   /*!< 0x00000010 */
#define RCC_CFGR2_PREDIV2_1                  (0x2UL << RCC_CFGR2_PREDIV2_Pos)   /*!< 0x00000020 */
#define RCC_CFGR2_PREDIV2_2                  (0x4UL << RCC_CFGR2_PREDIV2_Pos)   /*!< 0x00000040 */
#define RCC_CFGR2_PREDIV2_3                  (0x8UL << RCC_CFGR2_PREDIV2_Pos)   /*!< 0x00000080 */

#define RCC_CFGR2_PREDIV2_DIV1               0x00000000U                       /*!< PREDIV2 input clock not divided */
#define RCC_CFGR2_PREDIV2_DIV2_Pos           (4U)                              
#define RCC_CFGR2_PREDIV2_DIV2_Msk           (0x1UL << RCC_CFGR2_PREDIV2_DIV2_Pos) /*!< 0x00000010 */
#define RCC_CFGR2_PREDIV2_DIV2               RCC_CFGR2_PREDIV2_DIV2_Msk        /*!< PREDIV2 input clock divided by 2 */
#define RCC_CFGR2_PREDIV2_DIV3_Pos           (5U)                              
#define RCC_CFGR2_PREDIV2_DIV3_Msk           (0x1UL << RCC_CFGR2_PREDIV2_DIV3_Pos) /*!< 0x00000020 */
#define RCC_CFGR2_PREDIV2_DIV3               RCC_CFGR2_PREDIV2_DIV3_Msk        /*!< PREDIV2 input clock divided by 3 */
#define RCC_CFGR2_PREDIV2_DIV4_Pos           (4U)                              
#define RCC_CFGR2_PREDIV2_DIV4_Msk           (0x3UL << RCC_CFGR2_PREDIV2_DIV4_Pos) /*!< 0x00000030 */
#define RCC_CFGR2_PREDIV2_DIV4               RCC_CFGR2_PREDIV2_DIV4_Msk        /*!< PREDIV2 input clock divided by 4 */
#define RCC_CFGR2_PREDIV2_DIV5_Pos           (6U)                              
#define RCC_CFGR2_PREDIV2_DIV5_Msk           (0x1UL << RCC_CFGR2_PREDIV2_DIV5_Pos) /*!< 0x00000040 */
#define RCC_CFGR2_PREDIV2_DIV5               RCC_CFGR2_PREDIV2_DIV5_Msk        /*!< PREDIV2 input clock divided by 5 */
#define RCC_CFGR2_PREDIV2_DIV6_Pos           (4U)                              
#define RCC_CFGR2_PREDIV2_DIV6_Msk           (0x5UL << RCC_CFGR2_PREDIV2_DIV6_Pos) /*!< 0x00000050 */
#define RCC_CFGR2_PREDIV2_DIV6               RCC_CFGR2_PREDIV2_DIV6_Msk        /*!< PREDIV2 input clock divided by 6 */
#define RCC_CFGR2_PREDIV2_DIV7_Pos           (5U)                              
#define RCC_CFGR2_PREDIV2_DIV7_Msk           (0x3UL << RCC_CFGR2_PREDIV2_DIV7_Pos) /*!< 0x00000060 */
#define RCC_CFGR2_PREDIV2_DIV7               RCC_CFGR2_PREDIV2_DIV7_Msk        /*!< PREDIV2 input clock divided by 7 */
#define RCC_CFGR2_PREDIV2_DIV8_Pos           (4U)                              
#define RCC_CFGR2_PREDIV2_DIV8_Msk           (0x7UL << RCC_CFGR2_PREDIV2_DIV8_Pos) /*!< 0x00000070 */
#define RCC_CFGR2_PREDIV2_DIV8               RCC_CFGR2_PREDIV2_DIV8_Msk        /*!< PREDIV2 input clock divided by 8 */
#define RCC_CFGR2_PREDIV2_DIV9_Pos           (7U)                              
#define RCC_CFGR2_PREDIV2_DIV9_Msk           (0x1UL << RCC_CFGR2_PREDIV2_DIV9_Pos) /*!< 0x00000080 */
#define RCC_CFGR2_PREDIV2_DIV9               RCC_CFGR2_PREDIV2_DIV9_Msk        /*!< PREDIV2 input clock divided by 9 */
#define RCC_CFGR2_PREDIV2_DIV10_Pos          (4U)                              
#define RCC_CFGR2_PREDIV2_DIV10_Msk          (0x9UL << RCC_CFGR2_PREDIV2_DIV10_Pos) /*!< 0x00000090 */
#define RCC_CFGR2_PREDIV2_DIV10              RCC_CFGR2_PREDIV2_DIV10_Msk       /*!< PREDIV2 input clock divided by 10 */
#define RCC_CFGR2_PREDIV2_DIV11_Pos          (5U)                              
#define RCC_CFGR2_PREDIV2_DIV11_Msk          (0x5UL << RCC_CFGR2_PREDIV2_DIV11_Pos) /*!< 0x000000A0 */
#define RCC_CFGR2_PREDIV2_DIV11              RCC_CFGR2_PREDIV2_DIV11_Msk       /*!< PREDIV2 input clock divided by 11 */
#define RCC_CFGR2_PREDIV2_DIV12_Pos          (4U)                              
#define RCC_CFGR2_PREDIV2_DIV12_Msk          (0xBUL << RCC_CFGR2_PREDIV2_DIV12_Pos) /*!< 0x000000B0 */
#define RCC_CFGR2_PREDIV2_DIV12              RCC_CFGR2_PREDIV2_DIV12_Msk       /*!< PREDIV2 input clock divided by 12 */
#define RCC_CFGR2_PREDIV2_DIV13_Pos          (6U)                              
#define RCC_CFGR2_PREDIV2_DIV13_Msk          (0x3UL << RCC_CFGR2_PREDIV2_DIV13_Pos) /*!< 0x000000C0 */
#define RCC_CFGR2_PREDIV2_DIV13              RCC_CFGR2_PREDIV2_DIV13_Msk       /*!< PREDIV2 input clock divided by 13 */
#define RCC_CFGR2_PREDIV2_DIV14_Pos          (4U)                              
#define RCC_CFGR2_PREDIV2_DIV14_Msk          (0xDUL << RCC_CFGR2_PREDIV2_DIV14_Pos) /*!< 0x000000D0 */
#define RCC_CFGR2_PREDIV2_DIV14              RCC_CFGR2_PREDIV2_DIV14_Msk       /*!< PREDIV2 input clock divided by 14 */
#define RCC_CFGR2_PREDIV2_DIV15_Pos          (5U)                              
#define RCC_CFGR2_PREDIV2_DIV15_Msk          (0x7UL << RCC_CFGR2_PREDIV2_DIV15_Pos) /*!< 0x000000E0 */
#define RCC_CFGR2_PREDIV2_DIV15              RCC_CFGR2_PREDIV2_DIV15_Msk       /*!< PREDIV2 input clock divided by 15 */
#define RCC_CFGR2_PREDIV2_DIV16_Pos          (4U)                              
#define RCC_CFGR2_PREDIV2_DIV16_Msk          (0xFUL << RCC_CFGR2_PREDIV2_DIV16_Pos) /*!< 0x000000F0 */
#define RCC_CFGR2_PREDIV2_DIV16              RCC_CFGR2_PREDIV2_DIV16_Msk       /*!< PREDIV2 input clock divided by 16 */

/*!< PLL2MUL configuration */
#define RCC_CFGR2_PLL2MUL_Pos                (8U)                              
#define RCC_CFGR2_PLL2MUL_Msk                (0xFUL << RCC_CFGR2_PLL2MUL_Pos)   /*!< 0x00000F00 */
#define RCC_CFGR2_PLL2MUL                    RCC_CFGR2_PLL2MUL_Msk             /*!< PLL2MUL[3:0] bits */
#define RCC_CFGR2_PLL2MUL_0                  (0x1UL << RCC_CFGR2_PLL2MUL_Pos)   /*!< 0x00000100 */
#define RCC_CFGR2_PLL2MUL_1                  (0x2UL << RCC_CFGR2_PLL2MUL_Pos)   /*!< 0x00000200 */
#define RCC_CFGR2_PLL2MUL_2                  (0x4UL << RCC_CFGR2_PLL2MUL_Pos)   /*!< 0x00000400 */
#define RCC_CFGR2_PLL2MUL_3                  (0x8UL << RCC_CFGR2_PLL2MUL_Pos)   /*!< 0x00000800 */

#define RCC_CFGR2_PLL2MUL8_Pos               (9U)                              
#define RCC_CFGR2_PLL2MUL8_Msk               (0x3UL << RCC_CFGR2_PLL2MUL8_Pos)  /*!< 0x00000600 */
#define RCC_CFGR2_PLL2MUL8                   RCC_CFGR2_PLL2MUL8_Msk            /*!< PLL2 input clock * 8 */
#define RCC_CFGR2_PLL2MUL9_Pos               (8U)                              
#define RCC_CFGR2_PLL2MUL9_Msk               (0x7UL << RCC_CFGR2_PLL2MUL9_Pos)  /*!< 0x00000700 */
#define RCC_CFGR2_PLL2MUL9                   RCC_CFGR2_PLL2MUL9_Msk            /*!< PLL2 input clock * 9 */
#define RCC_CFGR2_PLL2MUL10_Pos              (11U)                             
#define RCC_CFGR2_PLL2MUL10_Msk              (0x1UL << RCC_CFGR2_PLL2MUL10_Pos) /*!< 0x00000800 */
#define RCC_CFGR2_PLL2MUL10                  RCC_CFGR2_PLL2MUL10_Msk           /*!< PLL2 input clock * 10 */
#define RCC_CFGR2_PLL2MUL11_Pos              (8U)                              
#define RCC_CFGR2_PLL2MUL11_Msk              (0x9UL << RCC_CFGR2_PLL2MUL11_Pos) /*!< 0x00000900 */
#define RCC_CFGR2_PLL2MUL11                  RCC_CFGR2_PLL2MUL11_Msk           /*!< PLL2 input clock * 11 */
#define RCC_CFGR2_PLL2MUL12_Pos              (9U)                              
#define RCC_CFGR2_PLL2MUL12_Msk              (0x5UL << RCC_CFGR2_PLL2MUL12_Pos) /*!< 0x00000A00 */
#define RCC_CFGR2_PLL2MUL12                  RCC_CFGR2_PLL2MUL12_Msk           /*!< PLL2 input clock * 12 */
#define RCC_CFGR2_PLL2MUL13_Pos              (8U)                              
#define RCC_CFGR2_PLL2MUL13_Msk              (0xBUL << RCC_CFGR2_PLL2MUL13_Pos) /*!< 0x00000B00 */
#define RCC_CFGR2_PLL2MUL13                  RCC_CFGR2_PLL2MUL13_Msk           /*!< PLL2 input clock * 13 */
#define RCC_CFGR2_PLL2MUL14_Pos              (10U)                             
#define RCC_CFGR2_PLL2MUL14_Msk              (0x3UL << RCC_CFGR2_PLL2MUL14_Pos) /*!< 0x00000C00 */
#define RCC_CFGR2_PLL2MUL14                  RCC_CFGR2_PLL2MUL14_Msk           /*!< PLL2 input clock * 14 */
#define RCC_CFGR2_PLL2MUL16_Pos              (9U)                              
#define RCC_CFGR2_PLL2MUL16_Msk              (0x7UL << RCC_CFGR2_PLL2MUL16_Pos) /*!< 0x00000E00 */
#define RCC_CFGR2_PLL2MUL16                  RCC_CFGR2_PLL2MUL16_Msk           /*!< PLL2 input clock * 16 */
#define RCC_CFGR2_PLL2MUL20_Pos              (8U)                              
#define RCC_CFGR2_PLL2MUL20_Msk              (0xFUL << RCC_CFGR2_PLL2MUL20_Pos) /*!< 0x00000F00 */
#define RCC_CFGR2_PLL2MUL20                  RCC_CFGR2_PLL2MUL20_Msk           /*!< PLL2 input clock * 20 */

