MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F105RB/mcu.h
/*******************  Bit definition for CAN_FM1R register  *******************/
#define CAN_FM1R_FBM_Pos                     (0U)                              
#define CAN_FM1R_FBM_Msk                     (0x3FFFUL << CAN_FM1R_FBM_Pos)     /*!< 0x00003FFF */
#define CAN_FM1R_FBM                         CAN_FM1R_FBM_Msk                  /*!< Filter Mode */
#define CAN_FM1R_FBM0_Pos                    (0U)                              
#define CAN_FM1R_FBM0_Msk                    (0x1UL << CAN_FM1R_FBM0_Pos)       /*!< 0x00000001 */
#define CAN_FM1R_FBM0                        CAN_FM1R_FBM0_Msk                 /*!< Filter Init Mode for filter 0 */
#define CAN_FM1R_FBM1_Pos                    (1U)                              
#define CAN_FM1R_FBM1_Msk                    (0x1UL << CAN_FM1R_FBM1_Pos)       /*!< 0x00000002 */
#define CAN_FM1R_FBM1                        CAN_FM1R_FBM1_Msk                 /*!< Filter Init Mode for filter 1 */
#define CAN_FM1R_FBM2_Pos                    (2U)                              
#define CAN_FM1R_FBM2_Msk                    (0x1UL << CAN_FM1R_FBM2_Pos)       /*!< 0x00000004 */
#define CAN_FM1R_FBM2                        CAN_FM1R_FBM2_Msk                 /*!< Filter Init Mode for filter 2 */
#define CAN_FM1R_FBM3_Pos                    (3U)                              
#define CAN_FM1R_FBM3_Msk                    (0x1UL << CAN_FM1R_FBM3_Pos)       /*!< 0x00000008 */
#define CAN_FM1R_FBM3                        CAN_FM1R_FBM3_Msk                 /*!< Filter Init Mode for filter 3 */
#define CAN_FM1R_FBM4_Pos                    (4U)                              
#define CAN_FM1R_FBM4_Msk                    (0x1UL << CAN_FM1R_FBM4_Pos)       /*!< 0x00000010 */
#define CAN_FM1R_FBM4                        CAN_FM1R_FBM4_Msk                 /*!< Filter Init Mode for filter 4 */
#define CAN_FM1R_FBM5_Pos                    (5U)                              
#define CAN_FM1R_FBM5_Msk                    (0x1UL << CAN_FM1R_FBM5_Pos)       /*!< 0x00000020 */
#define CAN_FM1R_FBM5                        CAN_FM1R_FBM5_Msk                 /*!< Filter Init Mode for filter 5 */
#define CAN_FM1R_FBM6_Pos                    (6U)                              
#define CAN_FM1R_FBM6_Msk                    (0x1UL << CAN_FM1R_FBM6_Pos)       /*!< 0x00000040 */
#define CAN_FM1R_FBM6                        CAN_FM1R_FBM6_Msk                 /*!< Filter Init Mode for filter 6 */
#define CAN_FM1R_FBM7_Pos                    (7U)                              
#define CAN_FM1R_FBM7_Msk                    (0x1UL << CAN_FM1R_FBM7_Pos)       /*!< 0x00000080 */
#define CAN_FM1R_FBM7                        CAN_FM1R_FBM7_Msk                 /*!< Filter Init Mode for filter 7 */
#define CAN_FM1R_FBM8_Pos                    (8U)                              
#define CAN_FM1R_FBM8_Msk                    (0x1UL << CAN_FM1R_FBM8_Pos)       /*!< 0x00000100 */
#define CAN_FM1R_FBM8                        CAN_FM1R_FBM8_Msk                 /*!< Filter Init Mode for filter 8 */
#define CAN_FM1R_FBM9_Pos                    (9U)                              
#define CAN_FM1R_FBM9_Msk                    (0x1UL << CAN_FM1R_FBM9_Pos)       /*!< 0x00000200 */
#define CAN_FM1R_FBM9                        CAN_FM1R_FBM9_Msk                 /*!< Filter Init Mode for filter 9 */
#define CAN_FM1R_FBM10_Pos                   (10U)                             
#define CAN_FM1R_FBM10_Msk                   (0x1UL << CAN_FM1R_FBM10_Pos)      /*!< 0x00000400 */
#define CAN_FM1R_FBM10                       CAN_FM1R_FBM10_Msk                /*!< Filter Init Mode for filter 10 */
#define CAN_FM1R_FBM11_Pos                   (11U)                             
#define CAN_FM1R_FBM11_Msk                   (0x1UL << CAN_FM1R_FBM11_Pos)      /*!< 0x00000800 */
#define CAN_FM1R_FBM11                       CAN_FM1R_FBM11_Msk                /*!< Filter Init Mode for filter 11 */
#define CAN_FM1R_FBM12_Pos                   (12U)                             
#define CAN_FM1R_FBM12_Msk                   (0x1UL << CAN_FM1R_FBM12_Pos)      /*!< 0x00001000 */
#define CAN_FM1R_FBM12                       CAN_FM1R_FBM12_Msk                /*!< Filter Init Mode for filter 12 */
#define CAN_FM1R_FBM13_Pos                   (13U)                             
#define CAN_FM1R_FBM13_Msk                   (0x1UL << CAN_FM1R_FBM13_Pos)      /*!< 0x00002000 */
#define CAN_FM1R_FBM13                       CAN_FM1R_FBM13_Msk                /*!< Filter Init Mode for filter 13 */
#define CAN_FM1R_FBM14_Pos                   (14U)                             
#define CAN_FM1R_FBM14_Msk                   (0x1UL << CAN_FM1R_FBM14_Pos)      /*!< 0x00004000 */
#define CAN_FM1R_FBM14                       CAN_FM1R_FBM14_Msk                /*!< Filter Init Mode for filter 14 */
#define CAN_FM1R_FBM15_Pos                   (15U)                             
#define CAN_FM1R_FBM15_Msk                   (0x1UL << CAN_FM1R_FBM15_Pos)      /*!< 0x00008000 */
#define CAN_FM1R_FBM15                       CAN_FM1R_FBM15_Msk                /*!< Filter Init Mode for filter 15 */
#define CAN_FM1R_FBM16_Pos                   (16U)                             
#define CAN_FM1R_FBM16_Msk                   (0x1UL << CAN_FM1R_FBM16_Pos)      /*!< 0x00010000 */
#define CAN_FM1R_FBM16                       CAN_FM1R_FBM16_Msk                /*!< Filter Init Mode for filter 16 */
#define CAN_FM1R_FBM17_Pos                   (17U)                             
#define CAN_FM1R_FBM17_Msk                   (0x1UL << CAN_FM1R_FBM17_Pos)      /*!< 0x00020000 */
#define CAN_FM1R_FBM17                       CAN_FM1R_FBM17_Msk                /*!< Filter Init Mode for filter 17 */
#define CAN_FM1R_FBM18_Pos                   (18U)                             
#define CAN_FM1R_FBM18_Msk                   (0x1UL << CAN_FM1R_FBM18_Pos)      /*!< 0x00040000 */
#define CAN_FM1R_FBM18                       CAN_FM1R_FBM18_Msk                /*!< Filter Init Mode for filter 18 */
#define CAN_FM1R_FBM19_Pos                   (19U)                             
#define CAN_FM1R_FBM19_Msk                   (0x1UL << CAN_FM1R_FBM19_Pos)      /*!< 0x00080000 */
#define CAN_FM1R_FBM19                       CAN_FM1R_FBM19_Msk                /*!< Filter Init Mode for filter 19 */
#define CAN_FM1R_FBM20_Pos                   (20U)                             
#define CAN_FM1R_FBM20_Msk                   (0x1UL << CAN_FM1R_FBM20_Pos)      /*!< 0x00100000 */
#define CAN_FM1R_FBM20                       CAN_FM1R_FBM20_Msk                /*!< Filter Init Mode for filter 20 */
#define CAN_FM1R_FBM21_Pos                   (21U)                             
#define CAN_FM1R_FBM21_Msk                   (0x1UL << CAN_FM1R_FBM21_Pos)      /*!< 0x00200000 */
#define CAN_FM1R_FBM21                       CAN_FM1R_FBM21_Msk                /*!< Filter Init Mode for filter 21 */
#define CAN_FM1R_FBM22_Pos                   (22U)                             
#define CAN_FM1R_FBM22_Msk                   (0x1UL << CAN_FM1R_FBM22_Pos)      /*!< 0x00400000 */
#define CAN_FM1R_FBM22                       CAN_FM1R_FBM22_Msk                /*!< Filter Init Mode for filter 22 */
#define CAN_FM1R_FBM23_Pos                   (23U)                             
#define CAN_FM1R_FBM23_Msk                   (0x1UL << CAN_FM1R_FBM23_Pos)      /*!< 0x00800000 */
#define CAN_FM1R_FBM23                       CAN_FM1R_FBM23_Msk                /*!< Filter Init Mode for filter 23 */
#define CAN_FM1R_FBM24_Pos                   (24U)                             
#define CAN_FM1R_FBM24_Msk                   (0x1UL << CAN_FM1R_FBM24_Pos)      /*!< 0x01000000 */
#define CAN_FM1R_FBM24                       CAN_FM1R_FBM24_Msk                /*!< Filter Init Mode for filter 24 */
#define CAN_FM1R_FBM25_Pos                   (25U)                             
#define CAN_FM1R_FBM25_Msk                   (0x1UL << CAN_FM1R_FBM25_Pos)      /*!< 0x02000000 */
#define CAN_FM1R_FBM25                       CAN_FM1R_FBM25_Msk                /*!< Filter Init Mode for filter 25 */
#define CAN_FM1R_FBM26_Pos                   (26U)                             
#define CAN_FM1R_FBM26_Msk                   (0x1UL << CAN_FM1R_FBM26_Pos)      /*!< 0x04000000 */
#define CAN_FM1R_FBM26                       CAN_FM1R_FBM26_Msk                /*!< Filter Init Mode for filter 26 */
#define CAN_FM1R_FBM27_Pos                   (27U)                             
#define CAN_FM1R_FBM27_Msk                   (0x1UL << CAN_FM1R_FBM27_Pos)      /*!< 0x08000000 */
#define CAN_FM1R_FBM27                       CAN_FM1R_FBM27_Msk                /*!< Filter Init Mode for filter 27 */

/*******************  Bit definition for CAN_FS1R register  *******************/
#define CAN_FS1R_FSC_Pos                     (0U)                              
#define CAN_FS1R_FSC_Msk                     (0x3FFFUL << CAN_FS1R_FSC_Pos)     /*!< 0x00003FFF */
#define CAN_FS1R_FSC                         CAN_FS1R_FSC_Msk                  /*!< Filter Scale Configuration */
#define CAN_FS1R_FSC0_Pos                    (0U)                              
#define CAN_FS1R_FSC0_Msk                    (0x1UL << CAN_FS1R_FSC0_Pos)       /*!< 0x00000001 */
#define CAN_FS1R_FSC0                        CAN_FS1R_FSC0_Msk                 /*!< Filter Scale Configuration for filter 0 */
#define CAN_FS1R_FSC1_Pos                    (1U)                              
#define CAN_FS1R_FSC1_Msk                    (0x1UL << CAN_FS1R_FSC1_Pos)       /*!< 0x00000002 */
#define CAN_FS1R_FSC1                        CAN_FS1R_FSC1_Msk                 /*!< Filter Scale Configuration for filter 1 */
#define CAN_FS1R_FSC2_Pos                    (2U)                              
#define CAN_FS1R_FSC2_Msk                    (0x1UL << CAN_FS1R_FSC2_Pos)       /*!< 0x00000004 */
#define CAN_FS1R_FSC2                        CAN_FS1R_FSC2_Msk                 /*!< Filter Scale Configuration for filter 2 */
#define CAN_FS1R_FSC3_Pos                    (3U)                              
#define CAN_FS1R_FSC3_Msk                    (0x1UL << CAN_FS1R_FSC3_Pos)       /*!< 0x00000008 */
#define CAN_FS1R_FSC3                        CAN_FS1R_FSC3_Msk                 /*!< Filter Scale Configuration for filter 3 */
#define CAN_FS1R_FSC4_Pos                    (4U)                              
#define CAN_FS1R_FSC4_Msk                    (0x1UL << CAN_FS1R_FSC4_Pos)       /*!< 0x00000010 */
#define CAN_FS1R_FSC4                        CAN_FS1R_FSC4_Msk                 /*!< Filter Scale Configuration for filter 4 */
#define CAN_FS1R_FSC5_Pos                    (5U)                              
#define CAN_FS1R_FSC5_Msk                    (0x1UL << CAN_FS1R_FSC5_Pos)       /*!< 0x00000020 */
#define CAN_FS1R_FSC5                        CAN_FS1R_FSC5_Msk                 /*!< Filter Scale Configuration for filter 5 */
#define CAN_FS1R_FSC6_Pos                    (6U)                              
#define CAN_FS1R_FSC6_Msk                    (0x1UL << CAN_FS1R_FSC6_Pos)       /*!< 0x00000040 */
#define CAN_FS1R_FSC6                        CAN_FS1R_FSC6_Msk                 /*!< Filter Scale Configuration for filter 6 */
#define CAN_FS1R_FSC7_Pos                    (7U)                              
#define CAN_FS1R_FSC7_Msk                    (0x1UL << CAN_FS1R_FSC7_Pos)       /*!< 0x00000080 */
#define CAN_FS1R_FSC7                        CAN_FS1R_FSC7_Msk                 /*!< Filter Scale Configuration for filter 7 */
#define CAN_FS1R_FSC8_Pos                    (8U)                              
#define CAN_FS1R_FSC8_Msk                    (0x1UL << CAN_FS1R_FSC8_Pos)       /*!< 0x00000100 */
#define CAN_FS1R_FSC8                        CAN_FS1R_FSC8_Msk                 /*!< Filter Scale Configuration for filter 8 */
#define CAN_FS1R_FSC9_Pos                    (9U)                              
#define CAN_FS1R_FSC9_Msk                    (0x1UL << CAN_FS1R_FSC9_Pos)       /*!< 0x00000200 */
#define CAN_FS1R_FSC9                        CAN_FS1R_FSC9_Msk                 /*!< Filter Scale Configuration for filter 9 */
#define CAN_FS1R_FSC10_Pos                   (10U)                             
#define CAN_FS1R_FSC10_Msk                   (0x1UL << CAN_FS1R_FSC10_Pos)      /*!< 0x00000400 */
#define CAN_FS1R_FSC10                       CAN_FS1R_FSC10_Msk                /*!< Filter Scale Configuration for filter 10 */
#define CAN_FS1R_FSC11_Pos                   (11U)                             
#define CAN_FS1R_FSC11_Msk                   (0x1UL << CAN_FS1R_FSC11_Pos)      /*!< 0x00000800 */
#define CAN_FS1R_FSC11                       CAN_FS1R_FSC11_Msk                /*!< Filter Scale Configuration for filter 11 */
#define CAN_FS1R_FSC12_Pos                   (12U)                             
#define CAN_FS1R_FSC12_Msk                   (0x1UL << CAN_FS1R_FSC12_Pos)      /*!< 0x00001000 */
#define CAN_FS1R_FSC12                       CAN_FS1R_FSC12_Msk                /*!< Filter Scale Configuration for filter 12 */
#define CAN_FS1R_FSC13_Pos                   (13U)                             
#define CAN_FS1R_FSC13_Msk                   (0x1UL << CAN_FS1R_FSC13_Pos)      /*!< 0x00002000 */
#define CAN_FS1R_FSC13                       CAN_FS1R_FSC13_Msk                /*!< Filter Scale Configuration for filter 13 */
#define CAN_FS1R_FSC14_Pos                   (14U)                             
#define CAN_FS1R_FSC14_Msk                   (0x1UL << CAN_FS1R_FSC14_Pos)      /*!< 0x00004000 */
#define CAN_FS1R_FSC14                       CAN_FS1R_FSC14_Msk                /*!< Filter Scale Configuration for filter 14 */
#define CAN_FS1R_FSC15_Pos                   (15U)                             
#define CAN_FS1R_FSC15_Msk                   (0x1UL << CAN_FS1R_FSC15_Pos)      /*!< 0x00008000 */
#define CAN_FS1R_FSC15                       CAN_FS1R_FSC15_Msk                /*!< Filter Scale Configuration for filter 15 */
#define CAN_FS1R_FSC16_Pos                   (16U)                             
#define CAN_FS1R_FSC16_Msk                   (0x1UL << CAN_FS1R_FSC16_Pos)      /*!< 0x00010000 */
#define CAN_FS1R_FSC16                       CAN_FS1R_FSC16_Msk                /*!< Filter Scale Configuration for filter 16 */
#define CAN_FS1R_FSC17_Pos                   (17U)                             
#define CAN_FS1R_FSC17_Msk                   (0x1UL << CAN_FS1R_FSC17_Pos)      /*!< 0x00020000 */
#define CAN_FS1R_FSC17                       CAN_FS1R_FSC17_Msk                /*!< Filter Scale Configuration for filter 17 */
#define CAN_FS1R_FSC18_Pos                   (18U)                             
#define CAN_FS1R_FSC18_Msk                   (0x1UL << CAN_FS1R_FSC18_Pos)      /*!< 0x00040000 */
#define CAN_FS1R_FSC18                       CAN_FS1R_FSC18_Msk                /*!< Filter Scale Configuration for filter 18 */
#define CAN_FS1R_FSC19_Pos                   (19U)                             
#define CAN_FS1R_FSC19_Msk                   (0x1UL << CAN_FS1R_FSC19_Pos)      /*!< 0x00080000 */
#define CAN_FS1R_FSC19                       CAN_FS1R_FSC19_Msk                /*!< Filter Scale Configuration for filter 19 */
#define CAN_FS1R_FSC20_Pos                   (20U)                             
#define CAN_FS1R_FSC20_Msk                   (0x1UL << CAN_FS1R_FSC20_Pos)      /*!< 0x00100000 */
#define CAN_FS1R_FSC20                       CAN_FS1R_FSC20_Msk                /*!< Filter Scale Configuration for filter 20 */
#define CAN_FS1R_FSC21_Pos                   (21U)                             
#define CAN_FS1R_FSC21_Msk                   (0x1UL << CAN_FS1R_FSC21_Pos)      /*!< 0x00200000 */
#define CAN_FS1R_FSC21                       CAN_FS1R_FSC21_Msk                /*!< Filter Scale Configuration for filter 21 */
#define CAN_FS1R_FSC22_Pos                   (22U)                             
#define CAN_FS1R_FSC22_Msk                   (0x1UL << CAN_FS1R_FSC22_Pos)      /*!< 0x00400000 */
#define CAN_FS1R_FSC22                       CAN_FS1R_FSC22_Msk                /*!< Filter Scale Configuration for filter 22 */
#define CAN_FS1R_FSC23_Pos                   (23U)                             
#define CAN_FS1R_FSC23_Msk                   (0x1UL << CAN_FS1R_FSC23_Pos)      /*!< 0x00800000 */
#define CAN_FS1R_FSC23                       CAN_FS1R_FSC23_Msk                /*!< Filter Scale Configuration for filter 23 */
#define CAN_FS1R_FSC24_Pos                   (24U)                             
#define CAN_FS1R_FSC24_Msk                   (0x1UL << CAN_FS1R_FSC24_Pos)      /*!< 0x01000000 */
#define CAN_FS1R_FSC24                       CAN_FS1R_FSC24_Msk                /*!< Filter Scale Configuration for filter 24 */
#define CAN_FS1R_FSC25_Pos                   (25U)                             
#define CAN_FS1R_FSC25_Msk                   (0x1UL << CAN_FS1R_FSC25_Pos)      /*!< 0x02000000 */
#define CAN_FS1R_FSC25                       CAN_FS1R_FSC25_Msk                /*!< Filter Scale Configuration for filter 25 */
#define CAN_FS1R_FSC26_Pos                   (26U)                             
#define CAN_FS1R_FSC26_Msk                   (0x1UL << CAN_FS1R_FSC26_Pos)      /*!< 0x04000000 */
#define CAN_FS1R_FSC26                       CAN_FS1R_FSC26_Msk                /*!< Filter Scale Configuration for filter 26 */
#define CAN_FS1R_FSC27_Pos                   (27U)                             
#define CAN_FS1R_FSC27_Msk                   (0x1UL << CAN_FS1R_FSC27_Pos)      /*!< 0x08000000 */
#define CAN_FS1R_FSC27                       CAN_FS1R_FSC27_Msk                /*!< Filter Scale Configuration for filter 27 */

